// 9)-----Switch case
// -----------------------------------------
// 10) -ЦЫКЛЫ
// -----------------------------------------
// 11) -ЦИКЛ While и do while
// -----------------------------------------
// 12) -break и continue
// -----------------------------------------
// 13) -вложенные циклы
// -----------------------------------------
// 14) -функции
// -----------------------------------------
// 15) -виды функцый
// -----------------------------------------
// 16) -обьекты
// -----------------------------------------
// 17) -методы обьектов
// -----------------------------------------
// 18) -циклы for in
// -----------------------------------------
// 19) -ДЕСТРУКТУРИЗАЦИЯ И SPREAD
const num = 100
switch (num) {
    case 0:
        console.log(0)
        break
    case 100:
        console.log(100)
        break

    case 150:
        console.log(150)
        break

    default:
        console.log('не сработало!')
}