
// _____________1
for (let i = 1; i <= 20; i++) {
  if (i % 4 === 0) {
    continue
  }
  console.log(i)
}

// ____________2
let number = parseInt(prompt("Введите число для вычисления факториала:"), 10)

if (isNaN(number) || number < 0) {
  alert("Пожалуйста, введите неотрицательное число.")
} else {
  let factorial = 1
  for (let i = 1; i <= number; i++) {
    factorial *= i
  }
  alert(`Факториал числа ${number} равен ${factorial}`)
}
// ____________3
for (let row = 0; row < 8; row++) {
  let line = '';
  for (let col = 0; col < 8; col++) {

    if ((row + col) % 2 === 0) {
      line += '#'
    } else {
      line += ' '
    }
  }
  console.log(line);
}


// true правда/ false лож.
// 1) string-строка
// 2) number-номер
// 3) boolean-логический
// 4) undefined-не определено
// 5) null-нулевой
// ---------------ОПЕРАТОРЫ СРАВНЕНИЯ-------------
// >, <, >=, <= -БОЛЬШЕ,МЕНЬШЕ, БОЛЬШЕ ЛИБО РАВНО,МЕНЬШЕ ЛИБО РАВНО
// == - НЕСТРОГОЕ СРАВНЕНИЕ
// === - СТРОГОЕ СРАВНЕНИЕ
// != - НЕСТРОГОЕ НЕРАВЕНСТВО
// !== - СТРОГОЕ НЕ РАВЕНСТВО
// ----------------------------------------
// ЛОГИЧЕСКИЕ ОПЕРАТОРЫ
// && -ЛОГИЧЕСКОЕ И
// || - ЛОГИЧЕСКОЕ ИЛИ
// !true - логическое не
